app/controllers/doors_controller.rb

  def index
    @doors = Door.all
---
SELECT "doors".* FROM "doors"

  def create
    @door = Door.new(door_params)

    respond_to do |format|
      if @door.save
---
INSERT INTO "doors" ("schedule", "description", "number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["schedule", "13 as 14"], ["description", "NTIC"], ["number", 1], ["created_at", "2017-09-09 11:21:48.849243"], ["updated_at", "2017-09-09 11:21:48.849243"]]

  def destroy
    @door.destroy
---
DELETE FROM "doors" WHERE "doors"."id" = ?  [["id", 980190962]]

    def set_door
      @door = Door.find(params[:id])
---
SELECT  "doors".* FROM "doors" WHERE "doors"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]